wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/ccap_reg.h
     * |        |          |00 = Motion Detection Window 8 Disabled.
     * |        |          |01 = Motion Detection Window 8 Enabled only when CCAP_INT[21:20] (MDIEN) is not equal to 0x0,.
     * |[9]     |WEN9      |Motion Detection Window 9 Enable Bit
     * |        |          |00 = Motion Detection Window 9 Disabled.
     * |        |          |01 = Motion Detection Window 9 Enabled only when CCAP_INT[21:20] (MDIEN) is not equal to 0x0.
     * |[10]    |WEN10     |Motion Detection Window 10 Enable Bit
     * |        |          |00 = Motion Detection Window 10 Disabled.
     * |        |          |01 = Motion Detection Window 10 Enabled only when CCAP_INT[21:20] (MDIEN) is not equal to 0x0.
     * |[11]    |WEN11     |Motion Detection Window 11 Enable Bit
     * |        |          |00 = Motion Detection Window 11 Disabled.
     * |        |          |01 = Motion Detection Window 11 Enabled only when CCAP_INT[21:20] (MDIEN) is not equal to 0x0.
     * |[12]    |WEN12     |Motion Detection Window 12 Enable Bit
     * |        |          |00 = Motion Detection Window 12 Disabled.
     * |        |          |01 = Motion Detection Window 12 Enabled only when CCAP_INT[21:20] (MDIEN) is not equal to 0x0.
     * |[13]    |WEN13     |Motion Detection Window 13 Enable Bit
     * |        |          |00 = Motion Detection Window 13 Disabled.
     * |        |          |01 = Motion Detection Window 13 Enabled only when CCAP_INT[21:20] (MDIEN) is not equal to 0x0.
     * |[14]    |WEN14     |Motion Detection Window 14 Enable Bit
     * |        |          |00 = Motion Detection Window 14 Disabled.
     * |        |          |01 = Motion Detection Window 14 Enabled only when CCAP_INT[21:20] (MDIEN) is not equal to 0x0.
     * |[15]    |WEN15     |Motion Detection Window 15 Enable Bit
     * |        |          |00 = Motion Detection Window 15 Disabled.
     * |        |          |01 = Motion Detection Window 15 Enabled only when CCAP_INT[21:20] (MDIEN) is not equal to 0x0.
     * @var CCAP_T::MDTRG_WK
     * Offset: 0x104  Motion Detection Trigger and Wakeup Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |TRGSEL    |Trigger Source Selection
     * |        |          |00 = LPTMR0.
     * |        |          |01 = LPTMR1.
     * |        |          |10 = TTMR0.
     * |        |          |11 = TTMR1.
     * |[16]    |WKEN      |Wake-up Function Enable Bit
     * |        |          |If this bit is set to 1, while Motion Detection Modes interrupt MDINTF (CCAP_INT[5:4]) is 1 and MDIEN (CCAP_INT[21:20]) is enabled, the CCAP interrupt signal will generate a wake-up trigger event to CPU.
     * |        |          |0 = Wake-up function Disabled if CCAP interrupt signal generated.
     * |        |          |1 = Wake-up function Enabled if CCAP interrupt signal generated.
     * |[24]    |WKF       |CCAP Wake-up Flag
     * |        |          |This bit indicates the interrupt wake-up flag status of CCAP.
     * |        |          |0 = CCAP does not cause CPU wake-up.
     * |        |          |1 = CPU wake-up from Idle or Power-down mode if MDINTF (CCAP_INT[5:4]) are generated.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * @var CCAP_T::MDTTH
     * Offset: 0x110  Motion Detection Total Threshold Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[20:0]  |MDTTH     |Motion Detection Total Threshold
     * |        |          |Specify the 21-bit threshold value for checking if the total SAD of all windows (CCAP_MDTSAD) is overflow
     * |        |          |Note: The maximum value of MDTSAD is 0x12AD40.
     * @var CCAP_T::MDTSAD
     * Offset: 0x114  Motion Detection Total SAD Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[20:0]  |MDTSAD    |Motion Detection Total SAD
     * |        |          |The total SAD (Sum of Absolute Differences) of all windows (i.e., CCAP_MDTSAD = CCAP_MDWSAD0 + CCAP_MDWSAD1 + CCAP_MDWSAD2 + CCAP_MDWSAD3 + CCAP_MDWSAD4 + CCAP_MDWSAD5 + CCAP_MDWSAD6 + CCAP_MDWSAD7 + CCAP_MDWSAD8 + CCAP_MDWSAD9 + CCAP_MDWSAD10 + CCAP_MDWSAD11 + CCAP_MDWSAD12 + CCAP_MDWSAD13 + CCAP_MDWSAD14 + CCAP_MDWSAD15).
     * |        |          |Note: The maximum value of MDTSAD is 0x12AD40.
     * @var CCAP_T::MDWOCTH
     * Offset: 0x120  Motion Detection Window Overflow Counter Threshold Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |MDWOCTH   |Motion Detection Window Overflow Counter threshold
     * |        |          |Specify the 4-bit threshold value for checking if CCAP_MDWOC is overflow.
     * @var CCAP_T::MDWOC
     * Offset: 0x124  Motion Detection Window Overflow Counter Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:0]   |MDWOC     |Motion Detection Window Overflow Counter
     * |        |          |The counter of windows that their CCAP_MDWSADx are larger than their CCAP_MDWTHx.
     * @var CCAP_T::MDWTH0
     * Offset: 0x140  Motion Detection Window Threshold 0 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH1
     * Offset: 0x144  Motion Detection Window Threshold 1 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH2
     * Offset: 0x148  Motion Detection Window Threshold 2 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH3
     * Offset: 0x14C  Motion Detection Window Threshold 3 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH4
     * Offset: 0x150  Motion Detection Window Threshold 4 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH5
     * Offset: 0x154  Motion Detection Window Threshold 5 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH6
     * Offset: 0x158  Motion Detection Window Threshold 6 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH7
     * Offset: 0x15C  Motion Detection Window Threshold 7 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH8
     * Offset: 0x160  Motion Detection Window Threshold 8 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH9
     * Offset: 0x164  Motion Detection Window Threshold 9 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH10
     * Offset: 0x168  Motion Detection Window Threshold 10 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH11
     * Offset: 0x16C  Motion Detection Window Threshold 11 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH12
     * Offset: 0x170  Motion Detection Window Threshold 12 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH13
     * Offset: 0x174  Motion Detection Window Threshold 13 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH14
     * Offset: 0x178  Motion Detection Window Threshold 14 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWTH15
     * Offset: 0x17C  Motion Detection Window Threshold 15 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWTH     |Motion Detection Window Threshold
     * |        |          |Specify the 17-bit threshold value for checking if the SAD of window x (CCAP_MDWSADx) is overflow.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD0
     * Offset: 0x180  Motion Detection Window SAD 0 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD1
     * Offset: 0x184  Motion Detection Window SAD 1 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD2
     * Offset: 0x188  Motion Detection Window SAD 2 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD3
     * Offset: 0x18C  Motion Detection Window SAD 3 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD4
     * Offset: 0x190  Motion Detection Window SAD 4 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD5
     * Offset: 0x194  Motion Detection Window SAD 5 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD6
     * Offset: 0x198  Motion Detection Window SAD 6 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD7
     * Offset: 0x19C  Motion Detection Window SAD 7 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD8
     * Offset: 0x1A0  Motion Detection Window SAD 8 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD9
     * Offset: 0x1A4  Motion Detection Window SAD 9 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD10
     * Offset: 0x1A8  Motion Detection Window SAD 10 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD11
     * Offset: 0x1AC  Motion Detection Window SAD 11 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD12
     * Offset: 0x1B0  Motion Detection Window SAD 12 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD13
     * Offset: 0x1B4  Motion Detection Window SAD 13 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD14
     * Offset: 0x1B8  Motion Detection Window SAD 14 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     * @var CCAP_T::MDWSAD15
     * Offset: 0x1BC  Motion Detection Window SAD 15 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:0]  |MDWSAD    |Motion Detection Window SAD
     * |        |          |The 17-bit value for the SAD (Sum of Absolute Differences) of window x.
     * |        |          |Note: The maximum value of MDWSAD is 0x12AD4.
     */
    __IO uint32_t CTL;                   /*!< [0x0000] Camera Capture Interface Control Register                        */
    __IO uint32_t PAR;                   /*!< [0x0004] Camera Capture Interface Parameter Register                      */
    __IO uint32_t INT;                   /*!< [0x0008] Camera Capture Interface Interrupt Enable Register               */
    __IO uint32_t INTSTS;                /*!< [0x000C] Camera Capture Interface Interrupt Status Register               */
    __IO uint32_t PARM;                  /*!< [0x0010] Camera Capture Interface Parameter Register (MSB)                */
    __I  uint32_t RESERVE1[3];
    __IO uint32_t CWSP;                  /*!< [0x0020] Cropping Window Starting Address Register                        */
    __IO uint32_t CWS;                   /*!< [0x0024] Cropping Window Size Register                                    */
    __IO uint32_t PKTSL;                 /*!< [0x0028] Packet Scaling Vertical/Horizontal Factor Register (LSB)         */
    __I  uint32_t RESERVE2[1];
    __IO uint32_t FRCTL;                 /*!< [0x0030] Scaling Frame Rate Factor Register                               */
    __IO uint32_t STRIDE;                /*!< [0x0034] Frame Output Pixel Stride Width Register                         */
    __I  uint32_t RESERVE3[1];
    __IO uint32_t FIFOTH;                /*!< [0x003c] FIFO Threshold Register                                          */
    __IO uint32_t CMPADDR;               /*!< [0x0040] Compare Memory Base Address Register                             */
