wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/ccap_reg.h
    __IO uint32_t LUMA_Y1_THD;           /*!< [0x0044] Luminance Y8 to Y1 Threshold Value Register                      */
    __IO uint32_t PKTSM;                 /*!< [0x0048] Packet Scaling Vertical/Horizontal Factor Register (MSB)         */
    __I  uint32_t RESERVE4[1];
    __I  uint32_t CURADDRP;              /*!< [0x0050] Current Packet System Memory Address Register                    */
    __I  uint32_t RESERVE5[3];
    __IO uint32_t PKTBA0;                /*!< [0x0060] System Memory Packet Base Address 0 Register                     */
    __I  uint32_t RESERVE6[39];
    __IO uint32_t MDCTL;                 /*!< [0x0100] Motion Detection Control Register                                */
    __IO uint32_t MDTRG_WK;              /*!< [0x0104] Motion Detection Trigger and Wakeup Register                     */
    __I  uint32_t RESERVE7[2];
    __IO uint32_t MDTTH;                 /*!< [0x0110] Motion Detection Total Threshold Register                        */
    __I  uint32_t MDTSAD;                /*!< [0x0114] Motion Detection Total SAD Register                              */
    __I  uint32_t RESERVE8[2];
    __IO uint32_t MDWOCTH;               /*!< [0x0120] Motion Detection Window Overflow Counter Threshold Register      */
    __I  uint32_t MDWOC;                 /*!< [0x0124] Motion Detection Window Overflow Counter Register                */
    __I  uint32_t RESERVE9[6];
    __IO uint32_t MDWTH[16];             /*!< [0x0140] ~ [0x017c] Motion Detection Window Threshold 0 ~ 15 Register      */
    __I  uint32_t MDWSAD[16];            /*!< [0x0180] ~ [0x01bc] Motion Detection Window SAD 0 ~ 15 Register            */

} CCAP_T;

/**
    @addtogroup CCAP_CONST CCAP Bit Field Definition
    Constant Definitions for CCAP Controller
@{ */

#define CCAP_CTL_CCAPEN_Pos              (0)                                               /*!< CCAP_T::CTL: CCAPEN Position           */
#define CCAP_CTL_CCAPEN_Msk              (0x1ul << CCAP_CTL_CCAPEN_Pos)                    /*!< CCAP_T::CTL: CCAPEN Mask               */

#define CCAP_CTL_PKTEN_Pos               (6)                                               /*!< CCAP_T::CTL: PKTEN Position            */
#define CCAP_CTL_PKTEN_Msk               (0x1ul << CCAP_CTL_PKTEN_Pos)                     /*!< CCAP_T::CTL: PKTEN Mask                */

#define CCAP_CTL_MONO_Pos                (7)                                               /*!< CCAP_T::CTL: MONO Position             */
#define CCAP_CTL_MONO_Msk                (0x1ul << CCAP_CTL_MONO_Pos)                      /*!< CCAP_T::CTL: MONO Mask                 */

#define CCAP_CTL_SHUTTER_Pos             (16)                                              /*!< CCAP_T::CTL: SHUTTER Position          */
#define CCAP_CTL_SHUTTER_Msk             (0x1ul << CCAP_CTL_SHUTTER_Pos)                   /*!< CCAP_T::CTL: SHUTTER Mask              */

#define CCAP_CTL_MY4_SWAP_Pos            (17)                                              /*!< CCAP_T::CTL: MY4_SWAP Position         */
#define CCAP_CTL_MY4_SWAP_Msk            (0x1ul << CCAP_CTL_MY4_SWAP_Pos)                  /*!< CCAP_T::CTL: MY4_SWAP Mask             */

#define CCAP_CTL_MY8_MY4_Pos             (18)                                              /*!< CCAP_T::CTL: MY8_MY4 Position          */
#define CCAP_CTL_MY8_MY4_Msk             (0x1ul << CCAP_CTL_MY8_MY4_Pos)                   /*!< CCAP_T::CTL: MY8_MY4 Mask              */

#define CCAP_CTL_Luma_Y_One_Pos          (19)                                              /*!< CCAP_T::CTL: Luma_Y_One Position       */
#define CCAP_CTL_Luma_Y_One_Msk          (0x1ul << CCAP_CTL_Luma_Y_One_Pos)                /*!< CCAP_T::CTL: Luma_Y_One Mask           */

#define CCAP_CTL_UPDATE_Pos              (20)                                              /*!< CCAP_T::CTL: UPDATE Position           */
#define CCAP_CTL_UPDATE_Msk              (0x1ul << CCAP_CTL_UPDATE_Pos)                    /*!< CCAP_T::CTL: UPDATE Mask               */

#define CCAP_CTL_VPRST_Pos               (24)                                              /*!< CCAP_T::CTL: VPRST Position            */
#define CCAP_CTL_VPRST_Msk               (0x1ul << CCAP_CTL_VPRST_Pos)                     /*!< CCAP_T::CTL: VPRST Mask                */

#define CCAP_PAR_INFMT_Pos               (0)                                               /*!< CCAP_T::PAR: INFMT Position            */
#define CCAP_PAR_INFMT_Msk               (0x1ul << CCAP_PAR_INFMT_Pos)                     /*!< CCAP_T::PAR: INFMT Mask                */

#define CCAP_PAR_SENTYPE_Pos             (1)                                               /*!< CCAP_T::PAR: SENTYPE Position          */
#define CCAP_PAR_SENTYPE_Msk             (0x1ul << CCAP_PAR_SENTYPE_Pos)                   /*!< CCAP_T::PAR: SENTYPE Mask              */

#define CCAP_PAR_INDATORD_Pos            (2)                                               /*!< CCAP_T::PAR: INDATORD Position         */
#define CCAP_PAR_INDATORD_Msk            (0x3ul << CCAP_PAR_INDATORD_Pos)                  /*!< CCAP_T::PAR: INDATORD Mask             */

#define CCAP_PAR_OUTFMT_Pos              (4)                                               /*!< CCAP_T::PAR: OUTFMT Position           */
#define CCAP_PAR_OUTFMT_Msk              (0x3ul << CCAP_PAR_OUTFMT_Pos)                    /*!< CCAP_T::PAR: OUTFMT Mask               */

#define CCAP_PAR_RANGE_Pos               (6)                                               /*!< CCAP_T::PAR: RANGE Position            */
#define CCAP_PAR_RANGE_Msk               (0x1ul << CCAP_PAR_RANGE_Pos)                     /*!< CCAP_T::PAR: RANGE Mask                */

#define CCAP_PAR_PCLKP_Pos               (8)                                               /*!< CCAP_T::PAR: PCLKP Position            */
#define CCAP_PAR_PCLKP_Msk               (0x1ul << CCAP_PAR_PCLKP_Pos)                     /*!< CCAP_T::PAR: PCLKP Mask                */

#define CCAP_PAR_HSP_Pos                 (9)                                               /*!< CCAP_T::PAR: HSP Position              */
#define CCAP_PAR_HSP_Msk                 (0x1ul << CCAP_PAR_HSP_Pos)                       /*!< CCAP_T::PAR: HSP Mask                  */

#define CCAP_PAR_VSP_Pos                 (10)                                              /*!< CCAP_T::PAR: VSP Position              */
#define CCAP_PAR_VSP_Msk                 (0x1ul << CCAP_PAR_VSP_Pos)                       /*!< CCAP_T::PAR: VSP Mask                  */

#define CCAP_PAR_FBB_Pos                 (18)                                              /*!< CCAP_T::PAR: FBB Position              */
#define CCAP_PAR_FBB_Msk                 (0x1ul << CCAP_PAR_FBB_Pos)                       /*!< CCAP_T::PAR: FBB Mask                  */

#define CCAP_INTSTS_VINTF_Pos            (0)                                               /*!< CCAP_T::INT: VINTF Position            */
#define CCAP_INTSTS_VINTF_Msk            (0x1ul << CCAP_INTSTS_VINTF_Pos)                  /*!< CCAP_T::INT: VINTF Mask                */

