wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/ccap_reg.h
#define CCAP_INTSTS_MEINTF_Pos           (1)                                               /*!< CCAP_T::INT: MEINTF Position           */
#define CCAP_INTSTS_MEINTF_Msk           (0x1ul << CCAP_INTSTS_MEINTF_Pos)                 /*!< CCAP_T::INT: MEINTF Mask               */

#define CCAP_INTSTS_ADDRMINTF_Pos        (3)                                               /*!< CCAP_T::INT: ADDRMINTF Position        */
#define CCAP_INTSTS_ADDRMINTF_Msk        (0x1ul << CCAP_INTSTS_ADDRMINTF_Pos)              /*!< CCAP_T::INT: ADDRMINTF Mask            */

#define CCAP_INTSTS_MDINTF_Pos           (4)                                               /*!< CCAP_T::INT: MDINTF Position           */
#define CCAP_INTSTS_MDINTF_Msk           (0x3ul << CCAP_INTSTS_MDINTF_Pos)                 /*!< CCAP_T::INT: MDINTF Mask               */

#define CCAP_INT_VIEN_Pos                (0)                                              /*!< CCAP_T::INT: VIEN Position             */
#define CCAP_INT_VIEN_Msk                (0x1ul << CCAP_INT_VIEN_Pos)                      /*!< CCAP_T::INT: VIEN Mask                 */

#define CCAP_INT_MEIEN_Pos               (1)                                              /*!< CCAP_T::INT: MEIEN Position            */
#define CCAP_INT_MEIEN_Msk               (0x1ul << CCAP_INT_MEIEN_Pos)                     /*!< CCAP_T::INT: MEIEN Mask                */

#define CCAP_INT_ADDRMIEN_Pos            (3)                                              /*!< CCAP_T::INT: ADDRMIEN Position         */
#define CCAP_INT_ADDRMIEN_Msk            (0x1ul << CCAP_INT_ADDRMIEN_Pos)                  /*!< CCAP_T::INT: ADDRMIEN Mask             */

#define CCAP_INT_MDIEN_Pos               (4)                                              /*!< CCAP_T::INT: MDIEN Position            */
#define CCAP_INT_MDIEN_Msk               (0x3ul << CCAP_INT_MDIEN_Pos)                     /*!< CCAP_T::INT: MDIEN Mask                */

#define CCAP_PARM_INFMTH_Pos             (0)                                               /*!< CCAP_T::PARM: INFMTH Position          */
#define CCAP_PARM_INFMTH_Msk             (0x1ul << CCAP_PARM_INFMTH_Pos)                   /*!< CCAP_T::PARM: INFMTH Mask              */

#define CCAP_PARM_INDATORDH_Pos          (8)                                               /*!< CCAP_T::PARM: INDATORDH Position       */
#define CCAP_PARM_INDATORDH_Msk          (0x1ul << CCAP_PARM_INDATORDH_Pos)                /*!< CCAP_T::PARM: INDATORDH Mask           */

#define CCAP_PARM_OUTFMTH_Pos            (16)                                              /*!< CCAP_T::PARM: OUTFMTH Position         */
#define CCAP_PARM_OUTFMTH_Msk            (0x1ul << CCAP_PARM_OUTFMTH_Pos)                  /*!< CCAP_T::PARM: OUTFMTH Mask             */

#define CCAP_PARM_RGB888OUTORD_Pos       (24)                                              /*!< CCAP_T::PARM: RGB888OUTORD Position    */
#define CCAP_PARM_RGB888OUTORD_Msk       (0x3ul << CCAP_PARM_RGB888OUTORD_Pos)             /*!< CCAP_T::PARM: RGB888OUTORD Mask        */

#define CCAP_CWSP_CWSADDRH_Pos           (0)                                               /*!< CCAP_T::CWSP: CWSADDRH Position        */
#define CCAP_CWSP_CWSADDRH_Msk           (0xffful << CCAP_CWSP_CWSADDRH_Pos)               /*!< CCAP_T::CWSP: CWSADDRH Mask            */

#define CCAP_CWSP_CWSADDRV_Pos           (16)                                              /*!< CCAP_T::CWSP: CWSADDRV Position        */
#define CCAP_CWSP_CWSADDRV_Msk           (0x7fful << CCAP_CWSP_CWSADDRV_Pos)               /*!< CCAP_T::CWSP: CWSADDRV Mask            */

#define CCAP_CWS_CWW_Pos                 (0)                                               /*!< CCAP_T::CWS: CWW Position              */
#define CCAP_CWS_CWW_Msk                 (0xffful << CCAP_CWS_CWW_Pos)                     /*!< CCAP_T::CWS: CWW Mask                  */

#define CCAP_CWS_CWH_Pos                 (16)                                              /*!< CCAP_T::CWS: CWH Position              */
#define CCAP_CWS_CWH_Msk                 (0x7fful << CCAP_CWS_CWH_Pos)                     /*!< CCAP_T::CWS: CWH Mask                  */

#define CCAP_PKTSL_PKTSHML_Pos           (0)                                               /*!< CCAP_T::PKTSL: PKTSHML Position        */
#define CCAP_PKTSL_PKTSHML_Msk           (0xfful << CCAP_PKTSL_PKTSHML_Pos)                /*!< CCAP_T::PKTSL: PKTSHML Mask            */

#define CCAP_PKTSL_PKTSHNL_Pos           (8)                                               /*!< CCAP_T::PKTSL: PKTSHNL Position        */
#define CCAP_PKTSL_PKTSHNL_Msk           (0xfful << CCAP_PKTSL_PKTSHNL_Pos)                /*!< CCAP_T::PKTSL: PKTSHNL Mask            */

#define CCAP_PKTSL_PKTSVML_Pos           (16)                                              /*!< CCAP_T::PKTSL: PKTSVML Position        */
#define CCAP_PKTSL_PKTSVML_Msk           (0xfful << CCAP_PKTSL_PKTSVML_Pos)                /*!< CCAP_T::PKTSL: PKTSVML Mask            */

#define CCAP_PKTSL_PKTSVNL_Pos           (24)                                              /*!< CCAP_T::PKTSL: PKTSVNL Position        */
#define CCAP_PKTSL_PKTSVNL_Msk           (0xfful << CCAP_PKTSL_PKTSVNL_Pos)                /*!< CCAP_T::PKTSL: PKTSVNL Mask            */

#define CCAP_FRCTL_FRM_Pos               (0)                                               /*!< CCAP_T::FRCTL: FRM Position            */
#define CCAP_FRCTL_FRM_Msk               (0x3ful << CCAP_FRCTL_FRM_Pos)                    /*!< CCAP_T::FRCTL: FRM Mask                */

#define CCAP_FRCTL_FRN_Pos               (8)                                               /*!< CCAP_T::FRCTL: FRN Position            */
#define CCAP_FRCTL_FRN_Msk               (0x3ful << CCAP_FRCTL_FRN_Pos)                    /*!< CCAP_T::FRCTL: FRN Mask                */

#define CCAP_STRIDE_PKTSTRIDE_Pos        (0)                                               /*!< CCAP_T::STRIDE: PKTSTRIDE Position     */
#define CCAP_STRIDE_PKTSTRIDE_Msk        (0x3ffful << CCAP_STRIDE_PKTSTRIDE_Pos)           /*!< CCAP_T::STRIDE: PKTSTRIDE Mask         */

#define CCAP_FIFOTH_PKTFTH_Pos           (24)                                              /*!< CCAP_T::FIFOTH: PKTFTH Position        */
#define CCAP_FIFOTH_PKTFTH_Msk           (0x1ful << CCAP_FIFOTH_PKTFTH_Pos)                /*!< CCAP_T::FIFOTH: PKTFTH Mask            */

#define CCAP_FIFOTH_OVF_Pos              (31)                                              /*!< CCAP_T::FIFOTH: OVF Position           */
#define CCAP_FIFOTH_OVF_Msk              (0x1ul << CCAP_FIFOTH_OVF_Pos)                    /*!< CCAP_T::FIFOTH: OVF Mask               */

