wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/ccap_reg.h
#define CCAP_CMPADDR_CMPADDR_Pos         (0)                                               /*!< CCAP_T::CMPADDR: CMPADDR Position      */
#define CCAP_CMPADDR_CMPADDR_Msk         (0xfffffffful << CCAP_CMPADDR_CMPADDR_Pos)        /*!< CCAP_T::CMPADDR: CMPADDR Mask          */

#define CCAP_LUMA_Y1_THD_LUMA_Y1_THRESH_Pos (0)                                            /*!< CCAP_T::LUMA_Y1_THD: LUMA_Y1_THRESH Position*/
#define CCAP_LUMA_Y1_THD_LUMA_Y1_THRESH_Msk (0xfful << CCAP_LUMA_Y1_THD_LUMA_Y1_THRESH_Pos) /*!< CCAP_T::LUMA_Y1_THD: LUMA_Y1_THRESH Mask*/

#define CCAP_PKTSM_PKTSHMH_Pos           (0)                                               /*!< CCAP_T::PKTSM: PKTSHMH Position        */
#define CCAP_PKTSM_PKTSHMH_Msk           (0xfful << CCAP_PKTSM_PKTSHMH_Pos)                /*!< CCAP_T::PKTSM: PKTSHMH Mask            */

#define CCAP_PKTSM_PKTSHNH_Pos           (8)                                               /*!< CCAP_T::PKTSM: PKTSHNH Position        */
#define CCAP_PKTSM_PKTSHNH_Msk           (0xfful << CCAP_PKTSM_PKTSHNH_Pos)                /*!< CCAP_T::PKTSM: PKTSHNH Mask            */

#define CCAP_PKTSM_PKTSVMH_Pos           (16)                                              /*!< CCAP_T::PKTSM: PKTSVMH Position        */
#define CCAP_PKTSM_PKTSVMH_Msk           (0xfful << CCAP_PKTSM_PKTSVMH_Pos)                /*!< CCAP_T::PKTSM: PKTSVMH Mask            */

#define CCAP_PKTSM_PKTSVNH_Pos           (24)                                              /*!< CCAP_T::PKTSM: PKTSVNH Position        */
#define CCAP_PKTSM_PKTSVNH_Msk           (0xfful << CCAP_PKTSM_PKTSVNH_Pos)                /*!< CCAP_T::PKTSM: PKTSVNH Mask            */

#define CCAP_CURADDRP_CURADDR_Pos        (0)                                               /*!< CCAP_T::CURADDRP: CURADDR Position     */
#define CCAP_CURADDRP_CURADDR_Msk        (0xfffffffful << CCAP_CURADDRP_CURADDR_Pos)       /*!< CCAP_T::CURADDRP: CURADDR Mask         */

#define CCAP_PKTBA0_BASEADDR_Pos         (0)                                               /*!< CCAP_T::PKTBA0: BASEADDR Position      */
#define CCAP_PKTBA0_BASEADDR_Msk         (0xfffffffful << CCAP_PKTBA0_BASEADDR_Pos)        /*!< CCAP_T::PKTBA0: BASEADDR Mask          */

#define CCAP_MDCTL_WEN0_Pos              (0)                                               /*!< CCAP_T::MDCTL: WEN0 Position           */
#define CCAP_MDCTL_WEN0_Msk              (0x1ul << CCAP_MDCTL_WEN0_Pos)                    /*!< CCAP_T::MDCTL: WEN0 Mask               */

#define CCAP_MDCTL_WEN1_Pos              (1)                                               /*!< CCAP_T::MDCTL: WEN1 Position           */
#define CCAP_MDCTL_WEN1_Msk              (0x1ul << CCAP_MDCTL_WEN1_Pos)                    /*!< CCAP_T::MDCTL: WEN1 Mask               */

#define CCAP_MDCTL_WEN2_Pos              (2)                                               /*!< CCAP_T::MDCTL: WEN2 Position           */
#define CCAP_MDCTL_WEN2_Msk              (0x1ul << CCAP_MDCTL_WEN2_Pos)                    /*!< CCAP_T::MDCTL: WEN2 Mask               */

#define CCAP_MDCTL_WEN3_Pos              (3)                                               /*!< CCAP_T::MDCTL: WEN3 Position           */
#define CCAP_MDCTL_WEN3_Msk              (0x1ul << CCAP_MDCTL_WEN3_Pos)                    /*!< CCAP_T::MDCTL: WEN3 Mask               */

#define CCAP_MDCTL_WEN4_Pos              (4)                                               /*!< CCAP_T::MDCTL: WEN4 Position           */
#define CCAP_MDCTL_WEN4_Msk              (0x1ul << CCAP_MDCTL_WEN4_Pos)                    /*!< CCAP_T::MDCTL: WEN4 Mask               */

#define CCAP_MDCTL_WEN5_Pos              (5)                                               /*!< CCAP_T::MDCTL: WEN5 Position           */
#define CCAP_MDCTL_WEN5_Msk              (0x1ul << CCAP_MDCTL_WEN5_Pos)                    /*!< CCAP_T::MDCTL: WEN5 Mask               */

#define CCAP_MDCTL_WEN6_Pos              (6)                                               /*!< CCAP_T::MDCTL: WEN6 Position           */
#define CCAP_MDCTL_WEN6_Msk              (0x1ul << CCAP_MDCTL_WEN6_Pos)                    /*!< CCAP_T::MDCTL: WEN6 Mask               */

#define CCAP_MDCTL_WEN7_Pos              (7)                                               /*!< CCAP_T::MDCTL: WEN7 Position           */
#define CCAP_MDCTL_WEN7_Msk              (0x1ul << CCAP_MDCTL_WEN7_Pos)                    /*!< CCAP_T::MDCTL: WEN7 Mask               */

#define CCAP_MDCTL_WEN8_Pos              (8)                                               /*!< CCAP_T::MDCTL: WEN8 Position           */
#define CCAP_MDCTL_WEN8_Msk              (0x1ul << CCAP_MDCTL_WEN8_Pos)                    /*!< CCAP_T::MDCTL: WEN8 Mask               */

#define CCAP_MDCTL_WEN9_Pos              (9)                                               /*!< CCAP_T::MDCTL: WEN9 Position           */
#define CCAP_MDCTL_WEN9_Msk              (0x1ul << CCAP_MDCTL_WEN9_Pos)                    /*!< CCAP_T::MDCTL: WEN9 Mask               */

#define CCAP_MDCTL_WEN10_Pos             (10)                                              /*!< CCAP_T::MDCTL: WEN10 Position          */
#define CCAP_MDCTL_WEN10_Msk             (0x1ul << CCAP_MDCTL_WEN10_Pos)                   /*!< CCAP_T::MDCTL: WEN10 Mask              */

#define CCAP_MDCTL_WEN11_Pos             (11)                                              /*!< CCAP_T::MDCTL: WEN11 Position          */
#define CCAP_MDCTL_WEN11_Msk             (0x1ul << CCAP_MDCTL_WEN11_Pos)                   /*!< CCAP_T::MDCTL: WEN11 Mask              */

#define CCAP_MDCTL_WEN12_Pos             (12)                                              /*!< CCAP_T::MDCTL: WEN12 Position          */
#define CCAP_MDCTL_WEN12_Msk             (0x1ul << CCAP_MDCTL_WEN12_Pos)                   /*!< CCAP_T::MDCTL: WEN12 Mask              */

#define CCAP_MDCTL_WEN13_Pos             (13)                                              /*!< CCAP_T::MDCTL: WEN13 Position          */
#define CCAP_MDCTL_WEN13_Msk             (0x1ul << CCAP_MDCTL_WEN13_Pos)                   /*!< CCAP_T::MDCTL: WEN13 Mask              */

#define CCAP_MDCTL_WEN14_Pos             (14)                                              /*!< CCAP_T::MDCTL: WEN14 Position          */
#define CCAP_MDCTL_WEN14_Msk             (0x1ul << CCAP_MDCTL_WEN14_Pos)                   /*!< CCAP_T::MDCTL: WEN14 Mask              */

#define CCAP_MDCTL_WEN15_Pos             (15)                                              /*!< CCAP_T::MDCTL: WEN15 Position          */
#define CCAP_MDCTL_WEN15_Msk             (0x1ul << CCAP_MDCTL_WEN15_Pos)                   /*!< CCAP_T::MDCTL: WEN15 Mask              */

#define CCAP_MDTRG_WK_TRGSEL_Pos         (0)                                               /*!< CCAP_T::MDTRG_WK: TRGSEL Position      */
#define CCAP_MDTRG_WK_TRGSEL_Msk         (0x3ul << CCAP_MDTRG_WK_TRGSEL_Pos)               /*!< CCAP_T::MDTRG_WK: TRGSEL Mask          */

#define CCAP_MDTRG_WK_WKEN_Pos           (16)                                              /*!< CCAP_T::MDTRG_WK: WKEN Position        */
#define CCAP_MDTRG_WK_WKEN_Msk           (0x1ul << CCAP_MDTRG_WK_WKEN_Pos)                 /*!< CCAP_T::MDTRG_WK: WKEN Mask            */

#define CCAP_MDTRG_WK_WKF_Pos            (24)                                              /*!< CCAP_T::MDTRG_WK: WKF Position         */
#define CCAP_MDTRG_WK_WKF_Msk            (0x1ul << CCAP_MDTRG_WK_WKF_Pos)                  /*!< CCAP_T::MDTRG_WK: WKF Mask             */

