wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/ccap_reg.h
#define CCAP_MDTTH_MDTTH_Pos             (0)                                               /*!< CCAP_T::MDTTH: MDTTH Position          */
#define CCAP_MDTTH_MDTTH_Msk             (0x1ffffful << CCAP_MDTTH_MDTTH_Pos)              /*!< CCAP_T::MDTTH: MDTTH Mask              */

#define CCAP_MDTSAD_MDTSAD_Pos           (0)                                               /*!< CCAP_T::MDTSAD: MDTSAD Position        */
#define CCAP_MDTSAD_MDTSAD_Msk           (0x1ffffful << CCAP_MDTSAD_MDTSAD_Pos)            /*!< CCAP_T::MDTSAD: MDTSAD Mask            */

#define CCAP_MDWOCTH_MDWOCTH_Pos         (0)                                               /*!< CCAP_T::MDWOCTH: MDWOCTH Position      */
#define CCAP_MDWOCTH_MDWOCTH_Msk         (0xful << CCAP_MDWOCTH_MDWOCTH_Pos)               /*!< CCAP_T::MDWOCTH: MDWOCTH Mask          */

#define CCAP_MDWOC_MDWOC_Pos             (0)                                               /*!< CCAP_T::MDWOC: MDWOC Position          */
#define CCAP_MDWOC_MDWOC_Msk             (0x1ful << CCAP_MDWOC_MDWOC_Pos)                  /*!< CCAP_T::MDWOC: MDWOC Mask              */

#define CCAP_MDWTH0_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH0: MDWTH Position         */
#define CCAP_MDWTH0_MDWTH_Msk            (0x1fffful << CCAP_MDWTH0_MDWTH_Pos)              /*!< CCAP_T::MDWTH0: MDWTH Mask             */

#define CCAP_MDWTH1_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH1: MDWTH Position         */
#define CCAP_MDWTH1_MDWTH_Msk            (0x1fffful << CCAP_MDWTH1_MDWTH_Pos)              /*!< CCAP_T::MDWTH1: MDWTH Mask             */

#define CCAP_MDWTH2_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH2: MDWTH Position         */
#define CCAP_MDWTH2_MDWTH_Msk            (0x1fffful << CCAP_MDWTH2_MDWTH_Pos)              /*!< CCAP_T::MDWTH2: MDWTH Mask             */

#define CCAP_MDWTH3_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH3: MDWTH Position         */
#define CCAP_MDWTH3_MDWTH_Msk            (0x1fffful << CCAP_MDWTH3_MDWTH_Pos)              /*!< CCAP_T::MDWTH3: MDWTH Mask             */

#define CCAP_MDWTH4_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH4: MDWTH Position         */
#define CCAP_MDWTH4_MDWTH_Msk            (0x1fffful << CCAP_MDWTH4_MDWTH_Pos)              /*!< CCAP_T::MDWTH4: MDWTH Mask             */

#define CCAP_MDWTH5_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH5: MDWTH Position         */
#define CCAP_MDWTH5_MDWTH_Msk            (0x1fffful << CCAP_MDWTH5_MDWTH_Pos)              /*!< CCAP_T::MDWTH5: MDWTH Mask             */

#define CCAP_MDWTH6_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH6: MDWTH Position         */
#define CCAP_MDWTH6_MDWTH_Msk            (0x1fffful << CCAP_MDWTH6_MDWTH_Pos)              /*!< CCAP_T::MDWTH6: MDWTH Mask             */

#define CCAP_MDWTH7_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH7: MDWTH Position         */
#define CCAP_MDWTH7_MDWTH_Msk            (0x1fffful << CCAP_MDWTH7_MDWTH_Pos)              /*!< CCAP_T::MDWTH7: MDWTH Mask             */

#define CCAP_MDWTH8_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH8: MDWTH Position         */
#define CCAP_MDWTH8_MDWTH_Msk            (0x1fffful << CCAP_MDWTH8_MDWTH_Pos)              /*!< CCAP_T::MDWTH8: MDWTH Mask             */

#define CCAP_MDWTH9_MDWTH_Pos            (0)                                               /*!< CCAP_T::MDWTH9: MDWTH Position         */
#define CCAP_MDWTH9_MDWTH_Msk            (0x1fffful << CCAP_MDWTH9_MDWTH_Pos)              /*!< CCAP_T::MDWTH9: MDWTH Mask             */

#define CCAP_MDWTH10_MDWTH_Pos           (0)                                               /*!< CCAP_T::MDWTH10: MDWTH Position        */
#define CCAP_MDWTH10_MDWTH_Msk           (0x1fffful << CCAP_MDWTH10_MDWTH_Pos)             /*!< CCAP_T::MDWTH10: MDWTH Mask            */

#define CCAP_MDWTH11_MDWTH_Pos           (0)                                               /*!< CCAP_T::MDWTH11: MDWTH Position        */
#define CCAP_MDWTH11_MDWTH_Msk           (0x1fffful << CCAP_MDWTH11_MDWTH_Pos)             /*!< CCAP_T::MDWTH11: MDWTH Mask            */

#define CCAP_MDWTH12_MDWTH_Pos           (0)                                               /*!< CCAP_T::MDWTH12: MDWTH Position        */
#define CCAP_MDWTH12_MDWTH_Msk           (0x1fffful << CCAP_MDWTH12_MDWTH_Pos)             /*!< CCAP_T::MDWTH12: MDWTH Mask            */

#define CCAP_MDWTH13_MDWTH_Pos           (0)                                               /*!< CCAP_T::MDWTH13: MDWTH Position        */
#define CCAP_MDWTH13_MDWTH_Msk           (0x1fffful << CCAP_MDWTH13_MDWTH_Pos)             /*!< CCAP_T::MDWTH13: MDWTH Mask            */

#define CCAP_MDWTH14_MDWTH_Pos           (0)                                               /*!< CCAP_T::MDWTH14: MDWTH Position        */
#define CCAP_MDWTH14_MDWTH_Msk           (0x1fffful << CCAP_MDWTH14_MDWTH_Pos)             /*!< CCAP_T::MDWTH14: MDWTH Mask            */

#define CCAP_MDWTH15_MDWTH_Pos           (0)                                               /*!< CCAP_T::MDWTH15: MDWTH Position        */
#define CCAP_MDWTH15_MDWTH_Msk           (0x1fffful << CCAP_MDWTH15_MDWTH_Pos)             /*!< CCAP_T::MDWTH15: MDWTH Mask            */

#define CCAP_MDWSAD0_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD0: MDWSAD Position       */
#define CCAP_MDWSAD0_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD0_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD0: MDWSAD Mask           */

#define CCAP_MDWSAD1_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD1: MDWSAD Position       */
#define CCAP_MDWSAD1_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD1_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD1: MDWSAD Mask           */

#define CCAP_MDWSAD2_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD2: MDWSAD Position       */
#define CCAP_MDWSAD2_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD2_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD2: MDWSAD Mask           */

#define CCAP_MDWSAD3_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD3: MDWSAD Position       */
#define CCAP_MDWSAD3_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD3_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD3: MDWSAD Mask           */

#define CCAP_MDWSAD4_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD4: MDWSAD Position       */
#define CCAP_MDWSAD4_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD4_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD4: MDWSAD Mask           */

#define CCAP_MDWSAD5_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD5: MDWSAD Position       */
#define CCAP_MDWSAD5_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD5_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD5: MDWSAD Mask           */

#define CCAP_MDWSAD6_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD6: MDWSAD Position       */
#define CCAP_MDWSAD6_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD6_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD6: MDWSAD Mask           */

#define CCAP_MDWSAD7_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD7: MDWSAD Position       */
#define CCAP_MDWSAD7_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD7_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD7: MDWSAD Mask           */

