wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/ccap_reg.h
#define CCAP_MDWSAD8_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD8: MDWSAD Position       */
#define CCAP_MDWSAD8_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD8_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD8: MDWSAD Mask           */

#define CCAP_MDWSAD9_MDWSAD_Pos          (0)                                               /*!< CCAP_T::MDWSAD9: MDWSAD Position       */
#define CCAP_MDWSAD9_MDWSAD_Msk          (0x1fffful << CCAP_MDWSAD9_MDWSAD_Pos)            /*!< CCAP_T::MDWSAD9: MDWSAD Mask           */

#define CCAP_MDWSAD10_MDWSAD_Pos         (0)                                               /*!< CCAP_T::MDWSAD10: MDWSAD Position      */
#define CCAP_MDWSAD10_MDWSAD_Msk         (0x1fffful << CCAP_MDWSAD10_MDWSAD_Pos)           /*!< CCAP_T::MDWSAD10: MDWSAD Mask          */

#define CCAP_MDWSAD11_MDWSAD_Pos         (0)                                               /*!< CCAP_T::MDWSAD11: MDWSAD Position      */
#define CCAP_MDWSAD11_MDWSAD_Msk         (0x1fffful << CCAP_MDWSAD11_MDWSAD_Pos)           /*!< CCAP_T::MDWSAD11: MDWSAD Mask          */

#define CCAP_MDWSAD12_MDWSAD_Pos         (0)                                               /*!< CCAP_T::MDWSAD12: MDWSAD Position      */
#define CCAP_MDWSAD12_MDWSAD_Msk         (0x1fffful << CCAP_MDWSAD12_MDWSAD_Pos)           /*!< CCAP_T::MDWSAD12: MDWSAD Mask          */

#define CCAP_MDWSAD13_MDWSAD_Pos         (0)                                               /*!< CCAP_T::MDWSAD13: MDWSAD Position      */
#define CCAP_MDWSAD13_MDWSAD_Msk         (0x1fffful << CCAP_MDWSAD13_MDWSAD_Pos)           /*!< CCAP_T::MDWSAD13: MDWSAD Mask          */

#define CCAP_MDWSAD14_MDWSAD_Pos         (0)                                               /*!< CCAP_T::MDWSAD14: MDWSAD Position      */
#define CCAP_MDWSAD14_MDWSAD_Msk         (0x1fffful << CCAP_MDWSAD14_MDWSAD_Pos)           /*!< CCAP_T::MDWSAD14: MDWSAD Mask          */

#define CCAP_MDWSAD15_MDWSAD_Pos         (0)                                               /*!< CCAP_T::MDWSAD15: MDWSAD Position      */
#define CCAP_MDWSAD15_MDWSAD_Msk         (0x1fffful << CCAP_MDWSAD15_MDWSAD_Pos)           /*!< CCAP_T::MDWSAD15: MDWSAD Mask          */

/** @} CCAP_CONST */
/** @} end of CCAP register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __CCAP_REG_H__ */
